package tera.gameserver.model.base;

import tera.Config;

/**
 * Таблица левел - экспа
 *
 * @author Ronn
 */
public abstract class Experience
{
	// вбито для теры всё точно кто изменит данные убью
	public final static int LEVEL[] =
	{
	  	-1, // level 0 (не используется)
	     0,
	     840,
	     1846,
	     3048,
	     4470,
	     6145,
	     8113,
	     10410,
	     13088,
	     16197,
	     19795,
	     23952,
	     31270,
	     35820,
	     43748,
	     52633,
	     62859,
	     83702,
	     98077,
	     114490,
	     171955,
	     226448,
	     278397,
	     322355,
	     361682,
	     456358,
	     579223,
	     684342,
	     747584,
	     839475,
	     954831,
	     1122643,
	     1254159,
	     1454823,
	     1719869,
	     2094194,
	     2592956,
	     3256218,
	     3824220,
	     4592201,
	     5303154,
	     6165755,
	     7452245,
	     9542027,
	     10942319,
	     12815896,
	     14351495,
	     16135907,
	     18594712,
	     22440436,
	     25893136,
	     29777105,
	     41116997,
	     62189458,
	     87065242,
	     116294286,
	     158023413,
	     206935442,
	     264049598,
	     345779269,
	     449513049,
	 };

	public static int getMaxLevel()
	{
		return Config.WORLD_PLAYER_MAX_LEVEL;
	}

	public static int getNextExperience(int currentLevel)
	{
		return LEVEL[currentLevel + 1];
	}
}